Revit 2026 API

# MetallicpaintFlecksType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetallicpaintFlecks" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetallicpaintFlecksType
```
```vb
Public Enumeration MetallicpaintFlecksType
```
```cpp
public enum class MetallicpaintFlecksType
```
```fsharp
type MetallicpaintFlecksType
```

| Member name | Value | Description |
| --- | --- | --- |
| Enable | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace